{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "the-context-text", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "the-context-text"}, "inbound_nodes": []}, {"name": "the-answer-text-up-to-the-current-token", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "the-answer-text-up-to-the-current-token"}, "inbound_nodes": []}, {"name": "Shared", "class_name": "Embedding", "config": {"name": "Shared", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 7000, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["the-context-text", 0, 0, {}]], [["the-answer-text-up-to-the-current-token", 0, 0, {}]]]}, {"name": "Encode-context", "class_name": "LSTM", "config": {"name": "Encode-context", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["Shared", 0, 0, {}]]]}, {"name": "Encode-answer-up-to-the-current-token", "class_name": "LSTM", "config": {"name": "Encode-answer-up-to-the-current-token", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["Shared", 1, 0, {}]]]}, {"name": "concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", "class_name": "Concatenate", "config": {"name": "concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", "trainable": true, "axis": 1}, "inbound_nodes": [[["Encode-context", 0, 0, {}], ["Encode-answer-up-to-the-current-token", 0, 0, {}]]]}, {"name": "relu-activation", "class_name": "Dense", "config": {"name": "relu-activation", "trainable": true, "units": 3500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", 0, 0, {}]]]}, {"name": "likelihood-of-the-current-token-using-softmax-activation", "class_name": "Dense", "config": {"name": "likelihood-of-the-current-token-using-softmax-activation", "trainable": true, "units": 7000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu-activation", 0, 0, {}]]]}], "input_layers": [["the-context-text", 0, 0], ["the-answer-text-up-to-the-current-token", 0, 0]], "output_layers": [["likelihood-of-the-current-token-using-softmax-activation", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 4.999999873689376e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of27.bin", "group1-shard2of27.bin", "group1-shard3of27.bin", "group1-shard4of27.bin", "group1-shard5of27.bin", "group1-shard6of27.bin", "group1-shard7of27.bin", "group1-shard8of27.bin", "group1-shard9of27.bin", "group1-shard10of27.bin", "group1-shard11of27.bin", "group1-shard12of27.bin", "group1-shard13of27.bin", "group1-shard14of27.bin", "group1-shard15of27.bin", "group1-shard16of27.bin", "group1-shard17of27.bin", "group1-shard18of27.bin", "group1-shard19of27.bin", "group1-shard20of27.bin", "group1-shard21of27.bin", "group1-shard22of27.bin", "group1-shard23of27.bin", "group1-shard24of27.bin", "group1-shard25of27.bin", "group1-shard26of27.bin", "group1-shard27of27.bin"], "weights": [{"name": "Encode-answer-up-to-the-current-token/kernel", "shape": [100, 1200], "dtype": "float32"}, {"name": "Encode-answer-up-to-the-current-token/recurrent_kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "Encode-answer-up-to-the-current-token/bias", "shape": [1200], "dtype": "float32"}, {"name": "Encode-context/kernel", "shape": [100, 1200], "dtype": "float32"}, {"name": "Encode-context/recurrent_kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "Encode-context/bias", "shape": [1200], "dtype": "float32"}, {"name": "Shared/embeddings", "shape": [7000, 100], "dtype": "float32"}, {"name": "likelihood-of-the-current-token-using-softmax-activation/kernel", "shape": [3500, 7000], "dtype": "float32"}, {"name": "likelihood-of-the-current-token-using-softmax-activation/bias", "shape": [7000], "dtype": "float32"}, {"name": "relu-activation/kernel", "shape": [600, 3500], "dtype": "float32"}, {"name": "relu-activation/bias", "shape": [3500], "dtype": "float32"}]}]}