{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,null],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"Embed-Token","class_name":"EmbeddingRet","config":{"input_dim":50257,"output_dim":768,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false,"input_length":null,"name":"Embed-Token","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"Embed-Token-Pos","class_name":"PositionEmbedding","config":{"name":"Embed-Token-Pos","trainable":true,"input_dim":1024,"output_dim":768,"mode":"add","embeddings_initializer":{"default_minval":-0.05,"default_maxval":0.05,"minval":-0.05,"maxval":0.05,"seed":null},"mask_zero":false},"inbound_nodes":[[["Embed-Token",0,0,{}]]]},{"name":"Encode-0-Norm1","class_name":"LayerNormalization","config":{"name":"Encode-0-Norm1","trainable":true},"inbound_nodes":[[["Embed-Token-Pos",0,0,{}]]]},{"name":"Encode-0-atten","class_name":"MultiHeadAttention","config":{"name":"Encode-0-atten","trainable":true},"inbound_nodes":[[["Encode-0-Norm1",0,0,{}]]]},{"name":"Encode-0-Add1","class_name":"Add","config":{"name":"Encode-0-Add1","trainable":true},"inbound_nodes":[[["Embed-Token-Pos",0,0,{}],["Encode-0-atten",0,0,{}]]]},{"name":"Encode-0-Norm2","class_name":"LayerNormalization","config":{"name":"Encode-0-Norm2","trainable":true},"inbound_nodes":[[["Encode-0-Add1",0,0,{}]]]},{"name":"Encode-0-feed","class_name":"FeedForward","config":{"name":"Encode-0-feed","trainable":true},"inbound_nodes":[[["Encode-0-Norm2",0,0,{}]]]},{"name":"Encode-0-Add2","class_name":"Add","config":{"name":"Encode-0-Add2","trainable":true},"inbound_nodes":[[["Encode-0-feed",0,0,{}],["Encode-0-Norm2",0,0,{}]]]},{"name":"Encode-1-Norm1","class_name":"LayerNormalization","config":{"name":"Encode-1-Norm1","trainable":true},"inbound_nodes":[[["Encode-0-Add2",0,0,{}]]]},{"name":"Encode-1-atten","class_name":"MultiHeadAttention","config":{"name":"Encode-1-atten","trainable":true},"inbound_nodes":[[["Encode-1-Norm1",0,0,{}]]]},{"name":"Encode-1-Add1","class_name":"Add","config":{"name":"Encode-1-Add1","trainable":true},"inbound_nodes":[[["Encode-0-Add2",0,0,{}],["Encode-1-atten",0,0,{}]]]},{"name":"Encode-1-Norm2","class_name":"LayerNormalization","config":{"name":"Encode-1-Norm2","trainable":true},"inbound_nodes":[[["Encode-1-Add1",0,0,{}]]]},{"name":"Encode-1-feed","class_name":"FeedForward","config":{"name":"Encode-1-feed","trainable":true},"inbound_nodes":[[["Encode-1-Norm2",0,0,{}]]]},{"name":"Encode-1-Add2","class_name":"Add","config":{"name":"Encode-1-Add2","trainable":true},"inbound_nodes":[[["Encode-1-feed",0,0,{}],["Encode-1-Norm2",0,0,{}]]]},{"name":"Encode-2-Norm1","class_name":"LayerNormalization","config":{"name":"Encode-2-Norm1","trainable":true},"inbound_nodes":[[["Encode-1-Add2",0,0,{}]]]},{"name":"Encode-2-atten","class_name":"MultiHeadAttention","config":{"name":"Encode-2-atten","trainable":true},"inbound_nodes":[[["Encode-2-Norm1",0,0,{}]]]},{"name":"Encode-2-Add1","class_name":"Add","config":{"name":"Encode-2-Add1","trainable":true},"inbound_nodes":[[["Encode-1-Add2",0,0,{}],["Encode-2-atten",0,0,{}]]]},{"name":"Encode-2-Norm2","class_name":"LayerNormalization","config":{"name":"Encode-2-Norm2","trainable":true},"inbound_nodes":[[["Encode-2-Add1",0,0,{}]]]},{"name":"Encode-2-feed","class_name":"FeedForward","config":{"name":"Encode-2-feed","trainable":true},"inbound_nodes":[[["Encode-2-Norm2",0,0,{}]]]},{"name":"Encode-2-Add2","class_name":"Add","config":{"name":"Encode-2-Add2","trainable":true},"inbound_nodes":[[["Encode-2-feed",0,0,{}],["Encode-2-Norm2",0,0,{}]]]},{"name":"Norm","class_name":"LayerNormalization","config":{"name":"Norm","trainable":true},"inbound_nodes":[[["Encode-2-Add2",0,0,{}]]]},{"name":"Output","class_name":"EmbeddingSim","config":{"name":"Output","trainable":true,"use_bias":false,"initializer":{},"regularizer":null,"constraint":null,"stop_gradient":false},"inbound_nodes":[[["Norm",0,0,{}],["Embed-Token",0,1,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["Output",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./chatbot.weights.bin"],"weights":[{"name":"Embed-Token-Pos/embeddings","shape":[1024,768],"dtype":"float32"},{"name":"Encode-0-Norm1/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-0-Norm1/beta","shape":[768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_Wq","shape":[768,768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_bq","shape":[768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_Wk","shape":[768,768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_bk","shape":[768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_Wv","shape":[768,768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_bv","shape":[768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_Wo","shape":[768,768],"dtype":"float32"},{"name":"Encode-0-atten/Encode-0-atten_bo","shape":[768],"dtype":"float32"},{"name":"Encode-0-Norm2/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-0-Norm2/beta","shape":[768],"dtype":"float32"},{"name":"Encode-0-feed/Encode-0-feed_W1","shape":[768,3072],"dtype":"float32"},{"name":"Encode-0-feed/Encode-0-feed_b1","shape":[3072],"dtype":"float32"},{"name":"Encode-0-feed/Encode-0-feed_W2","shape":[3072,768],"dtype":"float32"},{"name":"Encode-0-feed/Encode-0-feed_b2","shape":[768],"dtype":"float32"},{"name":"Encode-1-Norm1/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-1-Norm1/beta","shape":[768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_Wq","shape":[768,768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_bq","shape":[768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_Wk","shape":[768,768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_bk","shape":[768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_Wv","shape":[768,768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_bv","shape":[768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_Wo","shape":[768,768],"dtype":"float32"},{"name":"Encode-1-atten/Encode-1-atten_bo","shape":[768],"dtype":"float32"},{"name":"Encode-1-Norm2/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-1-Norm2/beta","shape":[768],"dtype":"float32"},{"name":"Encode-1-feed/Encode-1-feed_W1","shape":[768,3072],"dtype":"float32"},{"name":"Encode-1-feed/Encode-1-feed_b1","shape":[3072],"dtype":"float32"},{"name":"Encode-1-feed/Encode-1-feed_W2","shape":[3072,768],"dtype":"float32"},{"name":"Encode-1-feed/Encode-1-feed_b2","shape":[768],"dtype":"float32"},{"name":"Encode-2-Norm1/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-2-Norm1/beta","shape":[768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_Wq","shape":[768,768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_bq","shape":[768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_Wk","shape":[768,768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_bk","shape":[768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_Wv","shape":[768,768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_bv","shape":[768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_Wo","shape":[768,768],"dtype":"float32"},{"name":"Encode-2-atten/Encode-2-atten_bo","shape":[768],"dtype":"float32"},{"name":"Encode-2-Norm2/gamma","shape":[768],"dtype":"float32"},{"name":"Encode-2-Norm2/beta","shape":[768],"dtype":"float32"},{"name":"Encode-2-feed/Encode-2-feed_W1","shape":[768,3072],"dtype":"float32"},{"name":"Encode-2-feed/Encode-2-feed_b1","shape":[3072],"dtype":"float32"},{"name":"Encode-2-feed/Encode-2-feed_W2","shape":[3072,768],"dtype":"float32"},{"name":"Encode-2-feed/Encode-2-feed_b2","shape":[768],"dtype":"float32"},{"name":"Norm/gamma","shape":[768],"dtype":"float32"},{"name":"Norm/beta","shape":[768],"dtype":"float32"}]}]}